<template>
  <div class="concept_message">
    <div class="text">
      <heading :heading="heading" />
      <p>
        せっかくの船出は、やっぱりカッコいいデザインでキメていきたいところ。
      </p>
      <br>
      <p>
        スグスタなら、あなたの名刺からロゴ、ウェブサイトに至るまで、ビジネスのスタートに必要なデザインをトータルコーディネートします。
      </p>
    </div>
    <div class="svg">
      <svg class="image" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="641.35" height="665.71" viewBox="0 0 641.35 665.71"><defs><style>.cls-1{fill:none;}.cls-2{isolation:isolate;}.cls-3{opacity:0.09;}.cls-3,.cls-5,.cls-7{mix-blend-mode:soft-light;}.cls-4{fill:url(#名称未設定グラデーション_5);}.cls-6{opacity:0.8;fill:url(#名称未設定グラデーション_5-2);}.cls-7{fill:url(#名称未設定グラデーション_10);}.cls-8{fill:url(#名称未設定グラデーション_9);}.cls-9{fill:url(#名称未設定グラデーション_9-2);}.cls-10{fill:#4b86a6;opacity:0.6;mix-blend-mode:multiply;}.cls-11{fill:#c7c7c7;}.cls-12{fill:#ff7320;}.cls-13{fill:#f2f2f2;}.cls-14{clip-path:url(#clip-path);}.cls-15{fill:#e0e0e0;}.cls-16{clip-path:url(#clip-path-2);}.cls-17{fill:#fff;}.cls-18{fill:#025074;}.cls-19{clip-path:url(#clip-path-3);}.cls-20{fill:#e3e3e3;}.cls-21{fill:#024a74;}</style><linearGradient id="名称未設定グラデーション_5" x1="206.17" y1="647.21" x2="846.69" y2="647.21" gradientUnits="userSpaceOnUse"><stop offset="0.01" stop-color="#2dacc9"/><stop offset="0.06" stop-color="#38b3cd"/><stop offset="0.22" stop-color="#57c7d8"/><stop offset="0.39" stop-color="#6fd6e2"/><stop offset="0.57" stop-color="#80e1e8"/><stop offset="0.77" stop-color="#8be8ec"/><stop offset="1" stop-color="#8eeaed"/></linearGradient><linearGradient id="名称未設定グラデーション_5-2" x1="206.17" y1="352.51" x2="846.69" y2="352.51" xlink:href="#名称未設定グラデーション_5"/><linearGradient id="名称未設定グラデーション_10" x1="205.34" y1="589.2" x2="845.87" y2="589.2" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#2dacc9"/><stop offset="0.19" stop-color="#2ba7c6"/><stop offset="0.41" stop-color="#2599bd"/><stop offset="0.64" stop-color="#1a83af"/><stop offset="0.88" stop-color="#0c639b"/><stop offset="1" stop-color="#03508f"/></linearGradient><linearGradient id="名称未設定グラデーション_9" x1="465.12" y1="392.38" x2="686.66" y2="392.38" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#fff"/><stop offset="0.21" stop-color="#d7f8f9"/><stop offset="0.43" stop-color="#b7f2f4"/><stop offset="0.63" stop-color="#a1edf0"/><stop offset="0.83" stop-color="#93ebee"/><stop offset="1" stop-color="#8eeaed"/></linearGradient><linearGradient id="名称未設定グラデーション_9-2" x1="409.9" y1="418.23" x2="631.44" y2="418.23" xlink:href="#名称未設定グラデーション_9"/><clipPath id="clip-path" transform="translate(-205.34 -167)"><path class="cls-1" d="M434.74,387.45l0-6.52a3.87,3.87,0,0,0,2.3,3.21l0,6.53A3.91,3.91,0,0,1,434.74,387.45Z"/></clipPath><clipPath id="clip-path-2" transform="translate(-205.34 -167)"><path class="cls-1" d="M455.29,388.29l0,6.53a12.18,12.18,0,0,1-11,0l0-6.53A12.12,12.12,0,0,0,455.29,388.29Z"/></clipPath><clipPath id="clip-path-3" transform="translate(-205.34 -167)"><path class="cls-1" d="M456.75,297.41l-.15,81.27a.93.93,0,0,1-.55.77,2.92,2.92,0,0,1-2.67,0,1,1,0,0,1-.56-.78L453,297.4a1,1,0,0,0,.56.78,2.92,2.92,0,0,0,2.67,0A.93.93,0,0,0,456.75,297.41Z"/></clipPath></defs><g class="cls-2"><g id="水"><g class="cls-2"><g class="cls-3"><path class="cls-4" d="M832.24,627.16c19.18,11.07,19.28,29,.22,40.1L562,824.41c-19,11.07-50,11.07-69.22,0L220.62,667.25c-19.17-11.07-19.27-29-.23-40.09L490.82,470c19.06-11.08,50.05-11.08,69.22,0Z" transform="translate(-205.34 -167)"/></g><g class="cls-5"><path class="cls-6" d="M832.24,332.45c19.18,11.08,19.28,29,.22,40.11L562,529.71c-19,11.07-50,11.07-69.22,0L220.62,372.55c-19.17-11.07-19.27-29-.23-40.09L490.82,175.31c19.06-11.08,50.05-11.08,69.22,0Z" transform="translate(-205.34 -167)"/></g><path class="cls-7" d="M831.66,372.35,561.58,527.88c-19,11-50,11-69.13,0L220.6,372.34c-9.64-5.51-14.45-12.75-14.43-20l-.83,289.94c0,7.23,4.79,14.46,14.43,20L491.62,817.82c19.16,11,50.11,11,69.13,0L830.84,662.29c9.45-5.45,14.18-12.57,14.2-19.71l.83-289.94C845.85,359.78,841.12,366.9,831.66,372.35Z" transform="translate(-205.34 -167)"/></g><path class="cls-8" d="M465.46,395c4.69.65,9.33,1.32,14,1.88l7,.75c2.32.23,4.64.39,6.95.58q6.95.49,13.9.62c4.63.06,9.26.08,13.9,0,9.25-.16,18.64-.4,27.75-2.58A96.68,96.68,0,0,0,562.23,392c4.35-1.72,8.6-3.74,13-5.64a75.94,75.94,0,0,1,13.73-4.64c1.2-.22,2.41-.44,3.63-.64a14,14,0,0,1,1.83-.21l1.84-.14a58.32,58.32,0,0,1,7.36-.08l.92,0,.91.09,1.82.18,3.65.38,3.59.6,3.54.7c4.71,1,9.26,2.28,13.75,3.46s9,2.29,13.43,3.09c1.12.23,2.25.38,3.37.53l1.7.24,1.69.15c2.26.26,4.54.35,6.82.42a102.85,102.85,0,0,0,13.76-.82A124.52,124.52,0,0,0,686.28,387a.3.3,0,0,1,.21.56,75.67,75.67,0,0,1-27.57,7.67c-9.69.8-19.53-.63-28.74-2.94s-18-5.22-27-6a60.57,60.57,0,0,0-6.73-.26l-1.68,0a11.89,11.89,0,0,0-1.69.09c-1.11.12-2.23.22-3.35.32a85.75,85.75,0,0,0-13.41,3c-4.45,1.39-8.92,2.92-13.39,4.47-2.25.71-4.48,1.52-6.74,2.21s-4.52,1.43-6.82,2a164,164,0,0,1-28,5.7,102.19,102.19,0,0,1-14.32.33,138.68,138.68,0,0,1-14.25-1.31,122.21,122.21,0,0,1-27.52-7.28.3.3,0,0,1-.17-.39A.32.32,0,0,1,465.46,395Z" transform="translate(-205.34 -167)"/></g><g id="レイヤー_4" data-name="レイヤー 4"><path class="cls-9" d="M410.24,420.81c4.69.64,9.33,1.31,14,1.87l7,.75c2.32.23,4.64.39,6.95.58q7,.5,13.9.62c4.63.06,9.26.09,13.9,0,9.25-.16,18.64-.4,27.75-2.58A94,94,0,0,0,507,417.81c4.36-1.72,8.6-3.74,13-5.64a75.94,75.94,0,0,1,13.73-4.64c1.2-.22,2.41-.44,3.63-.63a14,14,0,0,1,1.83-.21l1.84-.15a60.28,60.28,0,0,1,7.36-.08l.93,0,.9.09,1.82.18,3.65.38,3.59.6,3.54.71c4.71,1,9.26,2.27,13.75,3.45s9,2.3,13.43,3.09c1.12.23,2.25.38,3.38.53l1.69.24,1.69.15c2.27.27,4.54.35,6.82.42a102.85,102.85,0,0,0,13.76-.82,122.24,122.24,0,0,0,13.75-2.69.31.31,0,0,1,.37.22.33.33,0,0,1-.16.35A75.8,75.8,0,0,1,603.7,421c-9.69.8-19.53-.63-28.74-2.94s-18-5.22-27-6a60.58,60.58,0,0,0-6.73-.27l-1.68,0a11.67,11.67,0,0,0-1.68.09c-1.12.13-2.24.22-3.36.32a86,86,0,0,0-13.41,3c-4.45,1.39-8.92,2.92-13.39,4.47-2.25.71-4.47,1.53-6.74,2.21s-4.51,1.44-6.82,2a164,164,0,0,1-28,5.7,102.19,102.19,0,0,1-14.32.33,135.94,135.94,0,0,1-14.25-1.31,122.21,122.21,0,0,1-27.52-7.28.3.3,0,0,1,.15-.57Z" transform="translate(-205.34 -167)"/></g><g id="ヨット"><path class="cls-10" d="M424.5,422.6c25.52,5.41,72,2.14,114.88-10.65l3.25.48h0a2.65,2.65,0,0,0,1-.13c.81-.24,1.54-.72,1.62-1.08,0-.19-.11-.3-.38-.33h0l-2.73-.41L513.28,393.9l.16-.7L512,393l-1,.29,1.07-7.56-16.41-.9-32.89,6.12c-1.67.5-3.5,1.11-5.43,1.81l-1,.35-1.5.56-1,.39-1,.4-1,.41-.53.2-1.06.43-1.61.65-1.09.45-.54.22c-3.28,1.36-6.64,2.82-9.94,4.29l-.54.25-1.64.73-1.09.49L428.48,405l-1,.47-1,.47L424,407.07l-.94.45-2.25,1.07-1.69.81-5,2.44-.59.29c-2.47,1.21-6.72,3.06-6.72,3.06l4.89,10S419.68,423.21,424.5,422.6Zm54.36-17.31,5-1.52,55.17,8.13C513.77,412.35,490.82,409.72,478.86,405.29Zm63.69,7.12h0Zm-.19-.09h0Zm0,0,0,0Zm.06,0,0,0Zm-.13-.09s0,0,0,0S542.34,412.28,542.34,412.29Zm0-.05v0Zm0-.06v0Zm2-1.25h0Zm-.35.09.15,0Zm.21-.06.09,0Zm.64-.08h0Zm-.36,0h0Zm.13,0h0Zm.12,0h0Z" transform="translate(-205.34 -167)"/><path class="cls-11" d="M507,368.92,397.44,413.49l12.26,8s46.58-8.26,62.75-17.6l31.44-18.11Z" transform="translate(-205.34 -167)"/><path class="cls-12" d="M475.15,399.34c-16.34,9.43-60,17.89-69.35,19.62l3.9,2.55s46.58-8.26,62.75-17.6l31.44-18.11.62-3.38Z" transform="translate(-205.34 -167)"/><path class="cls-13" d="M477.15,351.85,430,378.49c-16.17,9.34-32.6,35-32.6,35S444,405.24,460.2,395.9l46.81-27Z" transform="translate(-205.34 -167)"/><g class="cls-2"><g class="cls-2"><g class="cls-14"><path class="cls-15" d="M437.08,384.14l0,6.53a3.91,3.91,0,0,1-2.31-3.22l0-6.52a3.87,3.87,0,0,0,2.3,3.21Z" transform="translate(-205.34 -167)"/></g></g><polygon class="cls-11" points="276.54 205.84 276.51 212.36 249.92 227.82 249.95 221.29 276.54 205.84"/><polygon class="cls-15" points="238.92 221.29 238.89 227.82 231.7 223.67 231.74 217.14 238.92 221.29"/><g class="cls-2"><g class="cls-16"><g class="cls-2"><path class="cls-11" d="M455.29,388.29l0,6.53a11.32,11.32,0,0,1-5.65,1.32l0-6.53a11.29,11.29,0,0,0,5.65-1.32Z" transform="translate(-205.34 -167)"/><path class="cls-15" d="M449.64,389.61l0,6.53a11.21,11.21,0,0,1-5.38-1.32l0-6.53a11.21,11.21,0,0,0,5.38,1.32Z" transform="translate(-205.34 -167)"/></g></g></g><path class="cls-17" d="M481.89,372.84l-26.6,15.45a12.12,12.12,0,0,1-11,0l-7.18-4.15c-3.06-1.76-3.07-4.62,0-6.39l26.6-15.45Z" transform="translate(-205.34 -167)"/><polygon class="cls-18" points="234.37 220.3 234.36 223.2 231.16 221.35 231.18 218.46 234.37 220.3"/><polygon class="cls-18" points="239.72 223.42 239.71 226.32 236.51 224.47 236.53 221.57 239.72 223.42"/></g><g class="cls-2"><polygon class="cls-15" points="249.77 201.81 249.77 203.49 277.74 187.23 277.75 185.55 249.77 201.81"/><polygon class="cls-17" points="249.77 201.81 277.75 185.55 276.29 184.71 249.77 200.12 249.77 201.81"/></g><polygon class="cls-12" points="249.99 130.68 249.99 200.81 276.64 185.43 249.99 130.68"/><path class="cls-12" d="M453.14,301.07c-10.66,29-10.66,61.41,0,78.09-18.56,7.29-40.57,19.2-50.92,32C397.16,379.59,412.68,324.46,453.14,301.07Z" transform="translate(-205.34 -167)"/><g class="cls-2"><g class="cls-2"><g class="cls-19"><g class="cls-2"><path class="cls-11" d="M456.75,297.41l-.15,81.27a.93.93,0,0,1-.55.77l-.13.07.15-81.27.13-.07a.93.93,0,0,0,.55-.77Z" transform="translate(-205.34 -167)"/><path class="cls-15" d="M456.07,298.25l-.15,81.27a2.86,2.86,0,0,1-1.29.25l.15-81.27a2.86,2.86,0,0,0,1.29-.25Z" transform="translate(-205.34 -167)"/><path class="cls-11" d="M454.78,298.5l-.15,81.27a2.69,2.69,0,0,1-1.25-.32,1,1,0,0,1-.56-.78L453,297.4a1,1,0,0,0,.56.78,2.69,2.69,0,0,0,1.25.32Z" transform="translate(-205.34 -167)"/></g></g></g><path class="cls-20" d="M456.2,296.63a.82.82,0,0,1,0,1.55,2.92,2.92,0,0,1-2.67,0,.82.82,0,0,1,0-1.55A3,3,0,0,1,456.2,296.63Z" transform="translate(-205.34 -167)"/></g><polygon class="cls-18" points="249.77 223.62 249.78 226.4 254.9 223.41 254.89 220.63 249.77 223.62"/><polygon class="cls-18" points="256.72 219.57 256.73 222.35 261.85 219.37 261.83 216.58 256.72 219.57"/><polygon class="cls-18" points="263.3 215.69 263.32 218.47 268.44 215.47 268.42 212.69 263.3 215.69"/><polygon class="cls-18" points="270.25 211.64 270.26 214.42 275.38 211.43 275.37 208.65 270.25 211.64"/><path class="cls-17" d="M488.7,384.15a4.94,4.94,0,0,1-2.13,3.84h0c-1.17.7-2.12.13-2.12-1.28v-.16a5,5,0,0,1,2.12-3.84h0c1.18-.71,2.13-.13,2.13,1.28Z" transform="translate(-205.34 -167)"/><path class="cls-21" d="M488.44,384.29a4.35,4.35,0,0,1-1.87,3.38h0c-1,.62-1.86.12-1.86-1.13v-.13a4.37,4.37,0,0,1,1.86-3.38h0c1-.62,1.87-.12,1.87,1.13Z" transform="translate(-205.34 -167)"/><path class="cls-17" d="M496.83,379.47a4.93,4.93,0,0,1-2.12,3.84h0c-1.17.71-2.12.14-2.12-1.28v-.15a5,5,0,0,1,2.12-3.85h0c1.17-.7,2.12-.13,2.12,1.29Z" transform="translate(-205.34 -167)"/><path class="cls-21" d="M496.57,379.62a4.34,4.34,0,0,1-1.86,3.37h0c-1,.62-1.87.12-1.87-1.12v-.14a4.38,4.38,0,0,1,1.87-3.38h0c1-.62,1.86-.11,1.86,1.13Z" transform="translate(-205.34 -167)"/><path class="cls-17" d="M504.47,375.09a5,5,0,0,1-2.12,3.84h0c-1.17.7-2.12.13-2.12-1.28v-.16a5,5,0,0,1,2.12-3.84h0c1.17-.71,2.12-.13,2.12,1.28Z" transform="translate(-205.34 -167)"/><path class="cls-21" d="M504.21,375.23a4.35,4.35,0,0,1-1.86,3.38h0c-1,.62-1.87.12-1.87-1.13v-.13a4.35,4.35,0,0,1,1.87-3.38h0c1-.62,1.86-.12,1.86,1.12Z" transform="translate(-205.34 -167)"/></g></g></svg>
    </div>
  </div>
</template>

<script>
import svg_image from '../atoms/svg_image';
import heading from '../atoms/heading';

export default {
  components: {
    svg_image,
    heading,
  },

  data() {
    return {
      heading: ["新ビジネス、", "カッコ", "つけたい。"],
    }
  }
  }
</script>

<style lang="scss" scoped>
  .concept_message {
    display: flex;
    text-align: left;
    height: 100vh;
  }

  .text {
    margin: 25vh 5vw 0 10vw;
    vertical-align: middle;
  }

  .heading {
    margin-bottom: 1rem;
    font-size: 30px;
  }

  .svg {
    margin: 0 10vw 0 5vw;
  }

  svg {
    height: 100%;
    width: 100%;
  }

  @include screen-mobile {
      .concept_message {
        height: 100vh;
        position: relative;
      }
      .text {
        height: 50vh;
        text-align: center;
        margin: 10vh 10vw 0;
        padding: 1rem;
        overflow-wrap: break-word;
      }

      .svg {
        text-align: center;
        height: 30vh;
        width: 100vw;
        margin-bottom: 20px;
        position: absolute;
        bottom: 0;
      }
  }

</style>
